[
    {
        "State": "Alabama",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium",
        "Frequency": "Annually In Apr-May-Jun",
        "Interest rate / penalty": "12%",
        "Redemption period": "3 Years",
        "Online auction": "No",
        "Over the counter": "Yes",
        "Statute": "Code of Alabama 1975, Sec 40, Ch 10",
        "Description": "Alabama is a tax lien certificate state. With 67 counties, you have plenty of sales to choose from. Sales are held from April-June each year. The interest rate is fixed at 12 percent. The winning bid is whoever pays the most for the property. You only earn interest on the property taxes. You do not earn interest on your overbid.The owner has three years to redeem the property. If the property is not redeemed in that time, you take the lien certificate to the tax office and swap it for a tax deed. When you pay taxes as they come due, you also earn interest on them.The state Department of Revenue handles any unsold properties. To buy these, you need to know the parcel number for the property.Click HERE for the complete list of rules. To learn more about the rules, plus the tips and tricks of tax lien investing, take this Free Course from the leading authority on the subject.",
        "Notes": ""
    },
    {
        "State": "Arizona",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Bid Down the Interest Rate",
        "Frequency": "Annually in February",
        "Interest rate / penalty": "16%",
        "Redemption period": "3 Years",
        "Online auction": "Yes – Not All Counties. Various Sites. Largest County Is Maricopa County",
        "Over the counter": "Yes – Liens Only",
        "Statute": "Arizona Statute Title 42, Ch 18, Art 3",
        "Description": "In Arizona, you buy tax liens by bidding down the interest you will accept. The interest rate starts at 16%. Sales are held in February. The property owner has three years to redeem the lien. If the lien is not redeemed, you go to court and foreclose on the property.To buy a lien, you must fill out a bidder information card and complete an IRS form W-9. How you pay for a winning bid depends on that county’s tax collector. If you plan a wire transfer, you need to set this up with the tax collector before the sale. When additional taxes come due, pay them off. You earn interest on these at the same rate you bid in the auction.If a property does not sell, a tax deed sale may be held. Contact the tax office in the county where the property is located for information about this sale. For even more information, take this free mini course from the leading authority on tax lien certificates.",
        "Notes": ""
    },
    {
        "State": "Colorado",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium",
        "Frequency": "Annually in Fall",
        "Interest rate / penalty": "9 Points Above Federal Discount Rate (Prime)",
        "Redemption period": "3 Years",
        "Online auction": "Yes",
        "Over the counter": "Yes",
        "Statute": "Colorado Revised Statutes 39-1-102",
        "Description": "Colorado sells tax liens. The interest rate is 9% over the prime rate so it varies. The highest bidder gets the lien. Colorado lets people bid more than the amount of past-due taxes. Be aware you do not earn interest on this overpay nor do you get it back. The tax office keeps any amount you spend over the opening bid price. The bidding process is different in each county so check with the tax office before the sale.Some Colorado counties have in-person auctions and some have online sales. You need to register for the sale and send in a completed IRS form W-9.The owner has three years to redeem the deed. During that time, you need to pay taxes as they come due. You earn interest on those taxes as well. After three years, you can exchange the lien for a treasurer’s deed at the tax collector’s office.Click HERE to read the complete Statute. For a complete training on tax lien investing, you’ve come to the right place. You can get started today at no cost with this free mini class from Ted Thomas, America’s leading authority on tax lien certificates and tax defaulted property.",
        "Notes": ""
    },
    {
        "State": "Connecticut",
        "Type": "Hybrid – Liens & Redeemable Deeds",
        "Bidding process": "Premium",
        "Frequency": "Annually – Varies Throughout Year",
        "Interest rate / penalty": "N/A",
        "Redemption period": "1 Year With 18% Penalty",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Connecticut Gen Stat Title 12 Ch 204",
        "Description": "A lot of people look at tax deed states’ auctions and see undeveloped land. They give it a hard pass. Sometimes, that may be the right thing to do. Sometimes, that might NOT be the right thing to do.In Hartford, the City Council put an eye on several undeveloped tracts on the north edge of downtown. City officials reasoned if the City bought the property at the auction, they could use it for development. Hartford already owned some nearby parcels.If the City has genuine development plans for the area and can make it happen, property values in the area will go up. Investors and businesses will move in. This is an example of buying property in a tax sale and then selling it later, at a profit, to someone who wants to develop it. A purchase here should take a lot more research than usual. You need to know the City’s plans in detail. That will tell you if the property is worth buying. Ted Thomas can show you how to do the research, vet properties, buy and quickly sell them. Take advantage of this free class today.",
        "Notes": ""
    },
    {
        "State": "Florida",
        "Type": "Hybrid – Both",
        "Bidding process": "Liens – Bid Down the Interest Rate. Deed – Premium",
        "Frequency": "Throughout the Year Per County Discretion",
        "Interest rate / penalty": "18%",
        "Redemption period": "2 Years",
        "Online auction": "Yes",
        "Over the counter": "Yes",
        "Statute": "Florida Statutes Chapter 197",
        "Description": "The Balance, an online magazine for investors, said if you do it right, Florida is a great state for tax lien investing. “For example, Florida’s maximum interest rate is set at 18% while Arizona’s maximum rate tops out at 16%. Either one could help you earn more than you might in a fund that tracks an index like the S&P 500, depending on the condition of the stock market.”What The Balance is not telling you is the stock market has averaged 5.6 percent over the last 20 years, says the investing information website SoFi. SoFi adds, “In early 2000, the market was doing exceptionally well, but from late 2000 to 2002, the dot-com bust contributed to losses for three consecutive years. That period wasn’t helped from the aftermath of 9/11 in 2001. In 2008, the financial crisis led to huge losses.”Compare the stock market to an investment backed by state law, federal law and several Supreme Court decisions. Investing in tax lien states is safer than the stock market and delivers solid returns. Ted Thomas is based in Florida. Not only is he America’s leading authority on tax lien certificates, but he also knows Florida like the back of his hand. Take advantage of Ted’s expertise with this free course.",
        "Notes": ""
    },
    {
        "State": "Illinois",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Bid Down the Interest Rate",
        "Frequency": "Annually – Varies Throughout Year",
        "Interest rate / penalty": "36%",
        "Redemption period": "2 to 2 1/2 Years Depending on Classification of Property",
        "Online auction": "No",
        "Over the counter": "",
        "Statute": "35 ILCS 200/21",
        "Description": "CNBC looked at investing in tax lien states. The report studied Illinois and discovered it makes sense to have some tax liens in a portfolio of investments. The report starts with Bennie Smith, an ordinary man looking for a way to build some cash fast. He bought two properties in his town. The vacant lot was redeemed in less than a month and he pocketed a $100 profit, an excellent profit on a $600 investment. The other property he spent $5,000 on and wound up owning the home.The key to making a big profit quickly is to buy property that has a high chance of being redeemed. DS News, a website for the mortgage industry, says, “Redemption investors are more interested in obtaining a conservative, high-yield return upon the redemption/payment of their tax liens. That means focusing on states where the redemption periods are longer/less aggressive yet provide a high annual compounding yield, such as Illinois (36 months, 36 percent) or Iowa (24 months, 24 percent).” Learn from the foremost expert how you can earn high rates of return secured by real estate, like Bennie Smith did, and take this free class today.",
        "Notes": ""
    },
    {
        "State": "Indiana",
        "Type": "Tax Lien Certificate",
        "Bidding process": "“Overbid” (Premium)",
        "Frequency": "Annually Sometime in the Fall",
        "Interest rate / penalty": "10% Penalty if Redeemed in 1st 6 Months, 15% Penalty if Redeemed in Months 6-12, but Only on the Taxes and Fees Not the Overbid. Overbid Amount Receives 5% Interest.",
        "Redemption period": "1 Year if Sold at County Sale, Liens Not Sold at County Sale Are Certified to Commissioner and Sold in “Commissioner’s Certificate Sale” With 120 Day Redemption Period",
        "Online auction": "Yes",
        "Over the counter": "No but There Is a Second Auction Called a Commissioners Certificate Auction With a Shorter Redemption Period of 120 Days",
        "Statute": "Indiana Code 6-1.1-25",
        "Description": "Investing in tax lien states can happen across the country or next door to you. Noble County, IN, held a tax sale in the summer of 2020. One of the properties on the auction block was 2581 S. Lakeside Drive, Albion, a lot on Small High Lake. The past-due taxes were $15,632.89. That was more than a year of past-due taxes. A check at the real estate website Zillow shows the tax debt should run under $300 a year.Again, checking with Zillow, the property now has a house there. The Zillow estimated price is $21,000 and the website says the owner can expect to earn $675 a month in rent. That comes out to $8,100 per year. Figuring in taxes and other associated costs, even if you had to borrow the $15,632 to buy it, you would pay off the loan in under three years. With the loan paid off, you could then continue to rent the property and keep most of that $675 you earned every month. That’s a big profit. To learn how to make big profits from tax lien investing, take advantage of this free mini class.",
        "Notes": ""
    },
    {
        "State": "Iowa",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Random Selection Process in Lieu of Bid Down Ownership Interest",
        "Frequency": "Annually 3rd Monday of June",
        "Interest rate / penalty": "24%",
        "Redemption period": "2 Years",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Iowa Code Chapter 446",
        "Description": "A lot of people think they can only buy tax lien certificates for houses when investing in tax lien states. Not so. An article in Des Moines Register newspaper points that out. Writing in 2020, just as the Corona virus pandemic was beginning, the newspaper looked at tax sales in Polk County, The article also noted tax sales were unlikely in 2020 because of the pandemic. The report by Lee Rood found 5,000 properties across the county had past-due taxes. They included.Merle May Mall – owing $588,239Ramada Inn – owing $239,977Campus Town Apartments – owing $139,897While some investors cannot afford to drop nearly $600,000 on a tax lien certificate, Polk County had plenty more opportunities to invest for far less. These included more commercial properties, plenty of homes and some undeveloped land. Prices in the eventual auction started in the thousands and went up from there. You can take advantage of an opportunity today. Ted Thomas, the leading expert on tax liens, is offering you a free course.",
        "Notes": ""
    },
    {
        "State": "Kentucky",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Sealed Bid First Come First Serve Basis but Must Be Present",
        "Frequency": "Annually – Varies Throughout Year",
        "Interest rate / penalty": "12%",
        "Redemption period": "1 Year",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Kentucky Rev Statute Ch 134 Art 420",
        "Description": "Taylor County, county seat Campbellsville, keeps a running list of properties with past due taxes dating back to 2005. A recent check of the web page with the past-due properties shows most amounts were under $1,000. The biggest past due amount was $6,452.69. When we wrote this, the list was updated that day, so we don’t know which of these properties are headed to auction and which will be paid. Regardless, if you want to invest in tax lien states, Kentucky offers the chance to make big profits.Just as an exercise to see if a property is worth investing in, we looked at some properties. Here are some random selections.223 Risen Ave., Campbellsville. This is likely to hit the auction block because it has past due taxes dating back to 2011. The total taxes owed are under $2,000. Checking on the real estate information website Zillow, we learn the 1,602 square foot home has an estimated value of $40,000. If you get the property through a tax lien foreclosure, you could expect $975 a month in rent.115 Eggers Street, Campbellsville. Taxes on this house date back to 2010 and total a bit more than $600. This is a mobile home and has an assessed value of $10,000. Zillow warns it does not have all the facts about the property. The current pictures show a single-wide in rough shape. Unless you can get someone in Campbellsville to personally check this one out, best to avoid it.116 Baptist St, Campbellsville. Something important to note here. The taxes have eased up every year since 2013. That is not the case for all the properties in the list. More importantly, what does Zillow have to say about the 1 BR, 2 BA home? Zillow says it is worth $34,693. Zillow warns the house needs some work, which is obvious from the pictures. Another house you need more information about before investing.Just because a house needs work does not mean it is a bad investment. You are buying the lien, not the property. If the owner lives there, he will redeem it more than 95% of the time. Ted Thomas, the foremost authority on tax lien certificates and tax defaulted property investing, can teach you how to narrow down a list of properties to find the best deals and sell your bargain real estate purchases quickly for big profits. Start your education today with this free mini course.",
        "Notes": ""
    },
    {
        "State": "Louisiana",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Ownership Interest Bid Down",
        "Frequency": "",
        "Interest rate / penalty": "12% + 5% Penalty",
        "Redemption period": "3 Years",
        "Online auction": "Yes",
        "Over the counter": "No",
        "Statute": "Louisiana Revised Statute 47-2157",
        "Description": "In mid-May 2021, the St. Landry Parish (a parish in Louisiana is the same thing as county in other states), warned property owners a tax lien sale was coming. The warning came with additional information that should make tax lien states investors pay close attention. Big profits are waiting.“We have several landlords in the parish not paying their taxes but still collecting rent and making money off these properties,” Parish President Jessie Bellard told KLFY news.Since you are investing in a tax lien to make money and not get the property, buying a Louisiana tax lien on a rental property with tenants living in it makes sense. The property owner is not going to jeopardize his monthly income. He will redeem the property to stop you from foreclosing on it and taking the property along with his monthly income from the rent.You can tell if a property is owner-occupied or rental property by looking up the property tax records. If the owner has a different address than the property with the tax lien, then the property is either a vacation house or rental home. If the owner’s address and the tax sale property have the same address, he likely lives there. For investing purposes, it does not matter if the owner or a renter lives there. You can learn a lot from doing your homework on tax lien properties, especially if you know what to look for. Take this free class from an expert who can show you all the ins and outs and save you a lot of time.",
        "Notes": ""
    },
    {
        "State": "Maryland",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Varies by County",
        "Frequency": "Annually in May – June",
        "Interest rate / penalty": "Varies by County. Anywhere Between 8% – 20%",
        "Redemption period": "6 Months",
        "Online auction": "Some",
        "Over the counter": "",
        "Statute": "General Assembly of Maryland 14-833",
        "Description": "Baltimore’s 2021 tax sale had 87 pages of tax defaulted properties for the annual tax lien sale as published in the Daily Record. One of the important notes at the beginning of advertisement is that some of the listed items are for “alleys and descriptive properties.” Buying the tax lien on an alley in tax lien states is not a bad thing. You do need to know about any recorded easements and other access rights that go with the alley. If the alley is an important access for other properties, then someone will redeem the taxes to make sure they have continued access.Look beyond those listings to properties that have homes or commercial buildings on them. The Baltimore sale had plenty of those. Here is an example that some people might ignore.1821 Aisquith St – This is listed in the real estate guide website Zillow as a 3 BR, 1BA townhouse. Zillow has inside pictures that show the place needs a good bit of work. A Google Street View picture shows a 2 story home with boarded-up bottom windows. Zillow and the tax assessment are the same, with both saying it is worth $7,000. This might make some people shy away. Other see this a great investment to buy the lien and likely foreclose on the property. Judging from the Zillow pictures, another few thousand dollars could fix it up and net the investor a big profit.The City even has public and private resources dedicated to helping restore properties like this.Investing in properties that need work should be done with care. You have a lot of homework to do on a property like this. If at all possible, visit it in person. If you cannot do that, contact the city’s building department to get an opinion from people who review buildings for a living or ask a contractor or local real estate agent to give it a once-over and an estimate. It’s wise to get an opinion from an expert before you leap, and Ted Thomas is the foremost expert on tax lien certificates and tax delinquent property investing. If you want more knowledge before you leap into this lucrative niche of bargain real estate, take advantage of this free mini course.",
        "Notes": ""
    },
    {
        "State": "Mississippi",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium “Overbid”",
        "Frequency": "Annually Apr or Aug",
        "Interest rate / penalty": "18%",
        "Redemption period": "2 Years",
        "Online auction": "Some",
        "Over the counter": "No",
        "Statute": "Mississippi Code Sec 27-41-49 to 27-41-89",
        "Description": "When Hanock County, MS, held a tax sale in early May 2020, more than 300 properties went on the block. What set this sale apart from the usual sale in tax lien states is way the properties were sold; it was not a tax lien. Mississippi is a tax lien state, but these properties were not sold at the lien sale, says the news report in the Sun Herald newspaper.Another unusual fact about this sale is a “buy it now” feature. Rather than wait for the auction, bidders could log onto the state website, check out the property and agreed to buy it on the spot. No need to compete with other bidders! These are state-owned properties that did not sell in the regular tax lien auction.Many of the properties are vacant lots. You may wonder what use is buying a vacant lot. Since you get the property in this sale, you can resell it to the next door neighbor. The neighbor can expand his yard for a fraction of the price of buying the lot on the open market. As these properties list at a “buy it now” price of around 10 percent, you can buy the land and ask double what you paid. The neighbor gets a bigger yard for about 20% of the open market cost.Some of the properties are homes. The second one in the list, 6107 Walnut Dr, Pearlington, MS, is a mobile home with an estimated value of $35,000 according to Zillow and $32,000 according to the tax collector. Either way, with a purchase price of $3,781, it represents a deal. Zillow said you could rent the home, which is close to the Gulf of Mexico, for around $900 a month. At that much income, you would recoup your money in less than half a year. After that, you are earning profit for as long as you own that home. Yes, you can earn big profits in tax lien investing, and Ted Thomas can teach you how. With over 30 years of experience, Ted can show you where to find opportunities that other investors could overlook. Start today with this free course. If not today, when?",
        "Notes": ""
    },
    {
        "State": "Missouri",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium “Overbid”",
        "Frequency": "Annually in Aug",
        "Interest rate / penalty": "10% With 8% on Subsequent Years",
        "Redemption period": "1 Year",
        "Online auction": "Few",
        "Over the counter": "No",
        "Statute": "Missouri General Assembly Ch 140",
        "Notes": "Must Be a State Resident to Bid at Lien Sales. City of St Louis and Jackson County Use Different Process (Tax Deeds)",
        "Description": "If you are looking for one of the tax lien states without a lot of competition, consider Missouri. In 2018, Franklin County had 391 properties set for the annual sale. The tax office expected few of the properties to sell. “At the auction itself on Aug. 27 (2018), less than 50 of the 391 available properties will likely be sold,” the Missourian newspaper reported. The tax collector told the paper, “I think we sold 30 or 40 last year.”So that was one year in the Show Me State. The August 2020 sale was almost the same exact thing. “Franklin County was owed $635,657 in back taxes on just under 600 properties on the Aug. 24 tax sale roster as of Wednesday, and County Collector Doug Trentmann said he will be happy if 40 of the properties sell,” the Missourian reported. Of course, some of these properties are probably not worth the investment, but many are. With that many properties on the list and that few being sold, finding some bargains is just a matter of doing your homework. The good news is you’re here visiting America’s leading authority on tax lien certificates and tax defaulted property, so you can start doing your homework right now by taking this Free Class from Ted Thomas!"
    },
    {
        "State": "Montana",
        "Type": "Tax Lien Certificate",
        "Bidding process": "By Assignment via First Come First Serve Basis With Legal Requirements by Investor",
        "Frequency": "Annually in July",
        "Interest rate / penalty": "10% + 2% Penalty",
        "Redemption period": "3 Years",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Montana Code Ann 2015 Sec 15-16-301",
        "Description": "This news story notes that most of the properties in Montana’s tax lien sales are redeemed, but every year a few are not. Reporting for the Great Falls Tribune, David Murray looked into two cases where the owners did not pay their taxes, failed to redeem their property and someone else owned the houses.Cascade County sold one home for $1,125.45. When the owner still did not pay those past-due taxes nor the taxes for the next three years, the investor foreclosed and owned the home worth $139,300. That is an excellent return on investment and a very big profit.The Western News public notice section contained several tax foreclosures. One of those listed is 414 Montana Avenue Libby, MT. The investor paid $6,854.87 for the taxes and earned $1564.99 in interest. If the owner did not redeem the property for a total of $8,762,61, the foreclosure would go through and the buyer would own a $183,940 home. Zillow estimates the owner could rent it for $1,200 a month. Tax lien sales offer amazing opportunities to earn lucrative profits, and no one knows more about tax lien investing than Ted Thomas, America’s leading authority on investing in tax delinquent property. You can take advantage of Ted’s 30+ years of experience today with this free mini course.",
        "Notes": ""
    },
    {
        "State": "Nebraska",
        "Type": "Tax Lien Certificate",
        "Bidding process": "“Rotational” Bidding System",
        "Frequency": "Annually in March",
        "Interest rate / penalty": "14%",
        "Redemption period": "3 Years",
        "Online auction": "Only Douglas County",
        "Over the counter": "Yes",
        "Statute": "Nebraska Statue 77-1801",
        "Description": "Most people think of investing in homes when they look at tax lien sales like those in Nebraska. The truth is, any real estate can go to a tax sale. In Hall County’s 2021 sale notice, some of the property listed was for retail stores. A 3-bay shopping center at 2921 W HWY 30, Kearny, was listed with a past-due amount of $14,008.32. The shopping center is worth more than $700,000. Under the terms of the Nebraska sale, an investor earns 14%, nearly $2,000 per year, a big profit. When you are investing in a tax lien, the property is less important than the chance the owner will redeem the property. In this case, in Hall County, the owner is going to redeem the taxes in order to keep the profitable commercial buildings and the businesses in those buildings. On the other side, the chance of the owner redeeming a house that is destroyed by a fire or natural disaster is much lower. Look at it this way every time you invest in a tax lien. Are you willing to own the property? If the answer is yes, buy it. If the answer is no, go to the next property on the list. It’s always important to do your homework before you buy. Start doing your homework today by taking this free course from Ted Thomas. Is tax lien investing for you? This course will answer that question for you and only take about an hour of your time.",
        "Notes": ""
    },
    {
        "State": "New Hampshire",
        "Type": "N/A",
        "Bidding process": "N/A",
        "Frequency": "N/A",
        "Interest rate / penalty": "N/A",
        "Redemption period": "N/A",
        "Online auction": "N/A",
        "Over the counter": "N/A",
        "Statute": "2016 New Hampshire Rev Stat 5-80",
        "Description": "Every year someone files a court challenge to a sale in tax lien states. Every year the courts rule the overall sale is legal. The decisions sometimes fine-tune the process, but the sales go on.In April 2020, the New Hampshire Supreme Court handed down a ruling about a tax sale in Bedford. The city sold a house in a tax sale for about $83,000 more than the past-due taxes. That $83K was considered a profit for the City of Bedford. The Union Leader newspaper covered the case. The New Hampshire Supreme Court ruled the tax sale is certainly legal. However, the City of Bedford is not allowed to keep the excess or overbid on the property. That has to go to the property owner. The city is only allowed to collect the past-due taxes and the interest allowed to the city under state law. A lot of people wonder if this means investors cannot make a profit. Investors in a New Hampshire tax sale are still allowed to make a profit. Only the cities cannot make a profit. You can invest in New Hampshire tax sales and make big profits.Read the Court’s opinion here. Learn how to make big profits from tax sales today. Start with this free class. You won’t be disappointed, and it’s not often you can invest in yourself at no cost.",
        "Notes": ""
    },
    {
        "State": "New Jersey",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Bid Down the Interest Rate + Premium",
        "Frequency": "Annually Throughout the Year",
        "Interest rate / penalty": "18% + 2%-6% Penalty and 8% – 18% on Subs Depending on the Amount",
        "Redemption period": "2 Years",
        "Online auction": "Some",
        "Over the counter": "Yes",
        "Statute": "New Jersey Statutes Title 54 Ch 5",
        "Description": "A big question in tax lien sale states is how does bankruptcy affect the sale? In New Jersey, a bankruptcy filing can stop the sale, according to the federal Third Circuit Court of Appeals. What does this mean to an investor? It means that a homeowner can file bankruptcy within 90 days of the tax sale and the sale can be set aside. As unfortunate as this is, at least you, as an investor, will get your money back. How many investments do you know of that give your money back if something goes wrong? The ruling looked at the way New Jersey conducts its tax sales, so it probably will not affect other states within the Third Circuit Court’s region. New Jersey’s tax sale system is unique to the Garden State. When you’re investing in tax delinquent property, it’s important to know the rules. The good news is that you’re here visiting the leading authority on tax lien and tax deed investing. Take advantage of the expertise of the foremost expert with this free mini course.",
        "Notes": ""
    },
    {
        "State": "New York",
        "Type": "Hybrid – Both",
        "Bidding process": "Premium on Deeds",
        "Frequency": "Annually – Varies Throughout Year",
        "Interest rate / penalty": "20% on Liens With Bid Down",
        "Redemption period": "N/A",
        "Online auction": "Yes",
        "Over the counter": "No",
        "Statute": "New York Real Property Tax Law Art 11",
        "Description": "If you read the news about tax lien sales in the Empire State, you know New York City is having issues moving forward with a tax sale. The rest of the state is not having those problems. The rest of the tax lien states are also not having these problems.Floral Park in Nassau County set a sale for mid-May, 2021. Some of the properties in that sale were real deals. A house at 145 Emerson Ave., had past-due taxes of $3,740.85. Looking at the real estate website Zillow, you can see the home is worth around $1 million. The same tax liens sale listing had the most expensive tax lien as $9,235.98 for 6 Raff Ave. That is a duplex with an estimated value of $1 million. The property at 111 Iris Avenue had a listed sale price of $4,896.82. Zillow says it is worth about $720,000.When you look at how much these owners owe and compare that to value of the property, you can almost guarantee the owners will redeem the taxes. If they do not redeem, which is very rare, you can foreclose and own a home that is worth many times more than what you invested. That is a win any way you look at it. Tax liens are a lucrative passive investment secured by real estate. It doesn’t get any safer than that. Learn how you can get in on the profits. Take this free mini course from the foremost expert on tax lien and tax deed investing.",
        "Notes": ""
    },
    {
        "State": "Ohio",
        "Type": "Hybrid – Both",
        "Bidding process": "Premium on Deeds",
        "Frequency": "Annually Throughout the Year",
        "Interest rate / penalty": "18% With Bid Down",
        "Redemption period": "1 Year on Liens but Not Targeted for Individual Buyers",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Ohio Revised Code Section 5721.30",
        "Description": "Looking at the results from some of the Ohio tax lien sales, it is hard to understand why some properties did not sell. For instance, Stark County holds a tax sale every month. Each month some of the properties go unsold. Of course, doing your homework is critical to making a profit in tax lien states like Ohio.The May sale had 25 properties for sale. Twelve did not sell. A few vacant lots did not sell and some did. The average home cost in Canton is around $149,000, so a few thousand dollars for a lot to build a home on sounds reasonable. On other properties, who knows?For instance, 1120 Highland Road S.E. in Canton did not sell. It had an opening bid price of $11,988.27. A check on Zillow shows a small, but attractive, home with an estimated value of $17,000. Realtor.com puts the value at $48,000. With a price disparity that high, this property bears more investigation before bidding.1449 Gross Ave. N.E. in Canton started out at $11,070.54 and the winning bid was $20,500. Realtor.com and Zillow differ on the value. Realtor says it is worth about $38,000 and Zillow says about $16,000. This property certainly merited more investigation before buying the lien on it. The buyer decided the price was worth it. Tax lien investing is certainly worth it. The one-percenters have been taking advantage of tax lien sales for over 200 years, and now you can too. Get started today by taking this free course from Ted Thomas, America’s leading authority on tax lien certificates and tax defaulted property investing.",
        "Notes": ""
    },
    {
        "State": "Rhode Island",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium",
        "Frequency": "Varies",
        "Interest rate / penalty": "12%",
        "Redemption period": "1 Year",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Rhode Island Code Chapter 44-9-1",
        "Notes": "Sales Handled by Municipality, Not County",
        "Description": "Tax lien states, like Rhode Island, moved forward with sales in the post-pandemic world. “Providence Mayor Jorge Elorza — who positions himself as the ‘compassionate’ mayor — is moving forward with the tax sale auction of homes in the city — that for some, owe less than $500,” GoLocalProv News reported.The news story referred to the COVID-19 crisis and the problems it created. However, “[n]o one has requested properties be removed from the sale due to COVID-19 related issues,” said Emily Crowell, spokesperson for Elorza. The story does point out at least one hardship case and then quotes other local officials who point out the past-due taxes date before the COVID crisis.As an investor, what you should focus on is the chance to make a big profit in these kinds of sales. A brief check of the list of properties show some great opportunities. For instance, the property at 46 Royal Street sold at the auction for $5,897, the cost of the taxes. Zillow valued the home at $335,590. There’s no better time than now to start investing in tax liens, and you can begin today by taking advantage of this free mini course from Ted Thomas, the leading expert."
    },
    {
        "State": "South Dakota",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium",
        "Frequency": "3rd Monday Yearly in Dec",
        "Interest rate / penalty": "12%",
        "Redemption period": "3 Years + 60 Days",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "South Dakota Statutes Title 10 Chapter 20",
        "Notes": "Tax Lien Sales Are Not Common in SD",
        "Description": "The Rapid City Journal newspaper in South Dakota called the tax lien certificate sale there “a peculiar kind of auction.” There is nothing odd or peculiar about tax lien certificate states holding auctions to collect past-due taxes. It happens somewhere in the US every week.The newspaper article goes on to mistakenly describe the investing process as “a little like a short-term lender.” The newspaper does get it right when it states the buyer earns interest on the investment. The reporter also noted Pennington County had 681 properties on the block in that day’s auction. Only 382, just a bit more than half, were sold.The auction, according to the newspaper, was also one of the liveliest in years with plenty of bidders. That did cause some comments from the bidders in the crowd, but veteran tax lien investor Tom Beckius said, “The sale is large enough for everyone to be able to invest their money in a way that maximizes our returns.” If you’d like to learn how to maximize your returns from tax lien certificate investing, you’ve come to the right place. Ted Thomas is the foremost expert with over 30 years of experience, and today Ted is offering you the opportunity to take advantage of this free course."
    },
    {
        "State": "Vermont",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Premium",
        "Frequency": "Varies Based on Supply",
        "Interest rate / penalty": "12%",
        "Redemption period": "1 Year",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Vermont Statutes Title 32 Ch 133-9",
        "Notes": "Overbid Does Not Get Returned and Does Not Earn Interest. However, Tax Sales Are Very Rare in Vermont",
        "Description": "Tax lien states, like Vermont, sell liens for more than just land. A recent sale in Northfield listed a mobile home in the sale and just the home. The amount owed was $2,687.23.Some people might shy away from this. The reason is if the owner does not redeem the home, then what happens if the buyer forecloses? The owner could continue the lot rental and rent the mobile home, adding the cost of the lot rent onto the overall rent. The owner could sell the home to someone else. The question then becomes, is it worth the investment? The real estate website Zillow reports the home is in a small mobile home park. It gives a total value of $45,196 which is on the high end of the homes in that subdivision. That sounds still like a good buy. When in doubt, take a coursefrom the most recognized expert. This mini course from Ted Thomas is free."
    },
    {
        "State": "West Virginia",
        "Type": "Hybrid – Both",
        "Bidding process": "Premium",
        "Frequency": "Lien Sales Annually Oct – Nov. Deed Sales Are Held on as Needed Basis and Only on Properties That Were Not Sold at Lien Sale and Were Held by the County for 18 Months",
        "Interest rate / penalty": "12% on Liens",
        "Redemption period": "18 Months on Liens",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "West Virginia Code 11a Article 3",
        "Description": "Looking at the West Virginia tax lien sales provides a good example of why doing your homework is vital to your success as an investor. West Virginia University’s College of Law took a look at the process and what it means to the owner, the investor and the community trying to collect back taxes. This is specific to the Mountain State and does not apply to other tax lien states.The article emphasizes the point Ted Thomas makes over and over – Do your homework. WVU’s report notes some properties that go into the tax sale each year are abandoned or in poor condition. Such property can be a good investment, but you must do the research to find out if you can make money on it. Abandoned property can often be sold to a neighbor so that person can expand their yard. Downtown commercial property can be renovated and sold or rented.West Virginia News reports on a good example of why renovation and rehab properties are a good idea. “Community leaders in Wheeling and throughout West Virginia are applauding the state’s recent decision to make permanent the 25% historic rehabilitation tax credits, and officials predict it will spur future development in historic neighborhoods. In 2018, the West Virginia Legislature temporarily boosted the state’s historic rehabilitation tax credit from 10% to 25%. That beneficial bump was set to expire in 2022, but in light of the tremendous success and feedback, state officials removed that sunset date during the most recent legislative session.” If you’d like to be a tremendous success at tax lien investing, learn the ropes from Ted Thomas, the leading authority on tax lien certificates and tax deeds. You can get started today with this free mini course.",
        "Notes": ""
    },
    {
        "State": "Wyoming",
        "Type": "Tax Lien Certificate",
        "Bidding process": "Random Selection",
        "Frequency": "Annually in Jul – Sep",
        "Interest rate / penalty": "15% + 3% Penalty",
        "Redemption period": "4 Years",
        "Online auction": "No",
        "Over the counter": "No",
        "Statute": "Wyoming Statutes Title 39 Chapter 13",
        "Description": "Wyoming delivers the ability to make big profits in its tax lien sale, similar to other tax lien states. For instance, Unita County’s sale in 2020 listed a lot of properties. Here are a few examples of what went to the sale.118 Canyon Hollow Dr, Evanston – The past-due taxes were $1,287.19. Checking the property on the real estate guide website Zillow shows a 3 BR, 2BA home valued at $228,904. The home is occupied and the value is increasing. With monthly rent around $1,400 for this home, even if the owner does not live there, redeeming this property makes a lot of sense. This was a good parcel to buy.110 Benjamin Franklin St,, Evanston – This is another attractive 3 BR, 2 BA home. It has a value of $225K and a recommended rent of $1,500 a month. In this case, Zillow has plenty of inside pictures as well. The past-due taxes are $1,187.68, less than one percent of the home’s value. Making this even better, it sits in a well-developed neighborhood where home prices are on the rise. Even vacant lots here are selling for much more than the past-due taxes on this house.Moving out of Evanston into one of the suburbs, is 108 E Owen Ave, Lyman. This house is smaller than the two above and has a Zillow value of $163,208. At the same time, the tax burden is lower, with $891.96 listed as past-due in the newspaper’s public notice. This is another nice, developed neighborhood where undeveloped lots are worth as much as $30,000. There are lucrative profits to be made from tax lien sales. If you aren’t already taking advantage of this amazing investment vehicle, there is no better time to begin than today. Get yourself on the fast track. Act now and take this free class from Ted Thomas, America’s leading authority on tax lien and tax deed investing.",
        "Notes": ""
    }
]